yize00001/BMI323_PIC16_Practice/mcc_generated_files/system/pins.h
/**
 * Generated Pins header File
 * 
 * @file pins.h
 * 
 * @defgroup  pinsdriver Pins Driver
 * 
 * @brief This is generated driver header for pins. 
 *        This header file provides APIs for all pins selected in the GUI.
 *
 * @version Driver Version  3.0.0
*/

/*
? [2026] Microchip Technology Inc. and its subsidiaries.

    Subject to your compliance with these terms, you may use Microchip 
    software and any derivatives exclusively with Microchip products. 
    You are responsible for complying with 3rd party license terms  
    applicable to your use of 3rd party software (including open source  
    software) that may accompany Microchip software. SOFTWARE IS ?AS IS.? 
    NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS 
    SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT,  
    MERCHANTABILITY, OR FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT 
    WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, 
    INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE, COST OR EXPENSE OF ANY 
    KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF 
    MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE 
    FORESEEABLE. TO THE FULLEST EXTENT ALLOWED BY LAW, MICROCHIP?S 
    TOTAL LIABILITY ON ALL CLAIMS RELATED TO THE SOFTWARE WILL NOT 
    EXCEED AMOUNT OF FEES, IF ANY, YOU PAID DIRECTLY TO MICROCHIP FOR 
    THIS SOFTWARE.
*/

#ifndef PINS_H
#define PINS_H

#include <xc.h>

#define INPUT   1
#define OUTPUT  0

#define HIGH    1
#define LOW     0

#define ANALOG      1
#define DIGITAL     0

#define PULL_UP_ENABLED      1
#define PULL_UP_DISABLED     0

// get/set IO_RA4 aliases
#define IO_RA4_TRIS                 TRISAbits.TRISA4
#define IO_RA4_LAT                  LATAbits.LATA4
#define IO_RA4_PORT                 PORTAbits.RA4
#define IO_RA4_WPU                  WPUAbits.WPUA4
#define IO_RA4_OD                   ODCONAbits.ODCA4
#define IO_RA4_ANS                  ANSELAbits.ANSA4
#define IO_RA4_SetHigh()            do { LATAbits.LATA4 = 1; } while(0)
#define IO_RA4_SetLow()             do { LATAbits.LATA4 = 0; } while(0)
#define IO_RA4_Toggle()             do { LATAbits.LATA4 = ~LATAbits.LATA4; } while(0)
#define IO_RA4_GetValue()           PORTAbits.RA4
#define IO_RA4_SetDigitalInput()    do { TRISAbits.TRISA4 = 1; } while(0)
#define IO_RA4_SetDigitalOutput()   do { TRISAbits.TRISA4 = 0; } while(0)
#define IO_RA4_SetPullup()          do { WPUAbits.WPUA4 = 1; } while(0)
#define IO_RA4_ResetPullup()        do { WPUAbits.WPUA4 = 0; } while(0)
#define IO_RA4_SetPushPull()        do { ODCONAbits.ODCA4 = 0; } while(0)
#define IO_RA4_SetOpenDrain()       do { ODCONAbits.ODCA4 = 1; } while(0)
#define IO_RA4_SetAnalogMode()      do { ANSELAbits.ANSA4 = 1; } while(0)
#define IO_RA4_SetDigitalMode()     do { ANSELAbits.ANSA4 = 0; } while(0)
#define RA4_SetInterruptHandler  IO_RA4_SetInterruptHandler
// get/set IO_RB4 aliases
#define IO_RB4_TRIS                 TRISBbits.TRISB4
#define IO_RB4_LAT                  LATBbits.LATB4
#define IO_RB4_PORT                 PORTBbits.RB4
#define IO_RB4_WPU                  WPUBbits.WPUB4
#define IO_RB4_OD                   ODCONBbits.ODCB4
#define IO_RB4_ANS                  ANSELBbits.ANSB4
#define IO_RB4_SetHigh()            do { LATBbits.LATB4 = 1; } while(0)
#define IO_RB4_SetLow()             do { LATBbits.LATB4 = 0; } while(0)
#define IO_RB4_Toggle()             do { LATBbits.LATB4 = ~LATBbits.LATB4; } while(0)
#define IO_RB4_GetValue()           PORTBbits.RB4
#define IO_RB4_SetDigitalInput()    do { TRISBbits.TRISB4 = 1; } while(0)
#define IO_RB4_SetDigitalOutput()   do { TRISBbits.TRISB4 = 0; } while(0)
#define IO_RB4_SetPullup()          do { WPUBbits.WPUB4 = 1; } while(0)
#define IO_RB4_ResetPullup()        do { WPUBbits.WPUB4 = 0; } while(0)
#define IO_RB4_SetPushPull()        do { ODCONBbits.ODCB4 = 0; } while(0)
#define IO_RB4_SetOpenDrain()       do { ODCONBbits.ODCB4 = 1; } while(0)
#define IO_RB4_SetAnalogMode()      do { ANSELBbits.ANSB4 = 1; } while(0)
#define IO_RB4_SetDigitalMode()     do { ANSELBbits.ANSB4 = 0; } while(0)
// get/set IO_RB5 aliases
#define IO_RB5_TRIS                 TRISBbits.TRISB5
#define IO_RB5_LAT                  LATBbits.LATB5
#define IO_RB5_PORT                 PORTBbits.RB5
#define IO_RB5_WPU                  WPUBbits.WPUB5
#define IO_RB5_OD                   ODCONBbits.ODCB5
#define IO_RB5_ANS                  ANSELBbits.ANSB5
#define IO_RB5_SetHigh()            do { LATBbits.LATB5 = 1; } while(0)
#define IO_RB5_SetLow()             do { LATBbits.LATB5 = 0; } while(0)
#define IO_RB5_Toggle()             do { LATBbits.LATB5 = ~LATBbits.LATB5; } while(0)
#define IO_RB5_GetValue()           PORTBbits.RB5
#define IO_RB5_SetDigitalInput()    do { TRISBbits.TRISB5 = 1; } while(0)
#define IO_RB5_SetDigitalOutput()   do { TRISBbits.TRISB5 = 0; } while(0)
#define IO_RB5_SetPullup()          do { WPUBbits.WPUB5 = 1; } while(0)
#define IO_RB5_ResetPullup()        do { WPUBbits.WPUB5 = 0; } while(0)
#define IO_RB5_SetPushPull()        do { ODCONBbits.ODCB5 = 0; } while(0)
#define IO_RB5_SetOpenDrain()       do { ODCONBbits.ODCB5 = 1; } while(0)
#define IO_RB5_SetAnalogMode()      do { ANSELBbits.ANSB5 = 1; } while(0)
#define IO_RB5_SetDigitalMode()     do { ANSELBbits.ANSB5 = 0; } while(0)
// get/set IO_RB6 aliases
#define IO_RB6_TRIS                 TRISBbits.TRISB6
#define IO_RB6_LAT                  LATBbits.LATB6
#define IO_RB6_PORT                 PORTBbits.RB6
#define IO_RB6_WPU                  WPUBbits.WPUB6
#define IO_RB6_OD                   ODCONBbits.ODCB6
#define IO_RB6_ANS                  ANSELBbits.ANSB6
#define IO_RB6_SetHigh()            do { LATBbits.LATB6 = 1; } while(0)
#define IO_RB6_SetLow()             do { LATBbits.LATB6 = 0; } while(0)
#define IO_RB6_Toggle()             do { LATBbits.LATB6 = ~LATBbits.LATB6; } while(0)
#define IO_RB6_GetValue()           PORTBbits.RB6
#define IO_RB6_SetDigitalInput()    do { TRISBbits.TRISB6 = 1; } while(0)
#define IO_RB6_SetDigitalOutput()   do { TRISBbits.TRISB6 = 0; } while(0)
#define IO_RB6_SetPullup()          do { WPUBbits.WPUB6 = 1; } while(0)
#define IO_RB6_ResetPullup()        do { WPUBbits.WPUB6 = 0; } while(0)
#define IO_RB6_SetPushPull()        do { ODCONBbits.ODCB6 = 0; } while(0)
#define IO_RB6_SetOpenDrain()       do { ODCONBbits.ODCB6 = 1; } while(0)
#define IO_RB6_SetAnalogMode()      do { ANSELBbits.ANSB6 = 1; } while(0)
#define IO_RB6_SetDigitalMode()     do { ANSELBbits.ANSB6 = 0; } while(0)
// get/set IO_RB7 aliases
#define SLEEP_IND_TRIS                 TRISBbits.TRISB7
#define SLEEP_IND_LAT                  LATBbits.LATB7
#define SLEEP_IND_PORT                 PORTBbits.RB7
#define SLEEP_IND_WPU                  WPUBbits.WPUB7
#define SLEEP_IND_OD                   ODCONBbits.ODCB7
#define SLEEP_IND_ANS                  ANSELBbits.ANSB7
#define SLEEP_IND_SetHigh()            do { LATBbits.LATB7 = 1; } while(0)
#define SLEEP_IND_SetLow()             do { LATBbits.LATB7 = 0; } while(0)
#define SLEEP_IND_Toggle()             do { LATBbits.LATB7 = ~LATBbits.LATB7; } while(0)
#define SLEEP_IND_GetValue()           PORTBbits.RB7
#define SLEEP_IND_SetDigitalInput()    do { TRISBbits.TRISB7 = 1; } while(0)
#define SLEEP_IND_SetDigitalOutput()   do { TRISBbits.TRISB7 = 0; } while(0)
#define SLEEP_IND_SetPullup()          do { WPUBbits.WPUB7 = 1; } while(0)
#define SLEEP_IND_ResetPullup()        do { WPUBbits.WPUB7 = 0; } while(0)
#define SLEEP_IND_SetPushPull()        do { ODCONBbits.ODCB7 = 0; } while(0)
#define SLEEP_IND_SetOpenDrain()       do { ODCONBbits.ODCB7 = 1; } while(0)
#define SLEEP_IND_SetAnalogMode()      do { ANSELBbits.ANSB7 = 1; } while(0)
#define SLEEP_IND_SetDigitalMode()     do { ANSELBbits.ANSB7 = 0; } while(0)
// get/set IO_RC3 aliases
#define IO_RC3_TRIS                 TRISCbits.TRISC3
#define IO_RC3_LAT                  LATCbits.LATC3
#define IO_RC3_PORT                 PORTCbits.RC3
#define IO_RC3_WPU                  WPUCbits.WPUC3
#define IO_RC3_OD                   ODCONCbits.ODCC3
#define IO_RC3_ANS                  ANSELCbits.ANSC3
#define IO_RC3_SetHigh()            do { LATCbits.LATC3 = 1; } while(0)
#define IO_RC3_SetLow()             do { LATCbits.LATC3 = 0; } while(0)
#define IO_RC3_Toggle()             do { LATCbits.LATC3 = ~LATCbits.LATC3; } while(0)
#define IO_RC3_GetValue()           PORTCbits.RC3
#define IO_RC3_SetDigitalInput()    do { TRISCbits.TRISC3 = 1; } while(0)
#define IO_RC3_SetDigitalOutput()   do { TRISCbits.TRISC3 = 0; } while(0)
#define IO_RC3_SetPullup()          do { WPUCbits.WPUC3 = 1; } while(0)
#define IO_RC3_ResetPullup()        do { WPUCbits.WPUC3 = 0; } while(0)
#define IO_RC3_SetPushPull()        do { ODCONCbits.ODCC3 = 0; } while(0)
#define IO_RC3_SetOpenDrain()       do { ODCONCbits.ODCC3 = 1; } while(0)
#define IO_RC3_SetAnalogMode()      do { ANSELCbits.ANSC3 = 1; } while(0)
#define IO_RC3_SetDigitalMode()     do { ANSELCbits.ANSC3 = 0; } while(0)
// get/set IO_RC4 aliases
#define X9C_CS_TRIS                 TRISCbits.TRISC4
#define X9C_CS_LAT                  LATCbits.LATC4
#define X9C_CS_PORT                 PORTCbits.RC4
#define X9C_CS_WPU                  WPUCbits.WPUC4
#define X9C_CS_OD                   ODCONCbits.ODCC4
#define X9C_CS_ANS                  ANSELCbits.ANSC4
#define X9C_CS_SetHigh()            do { LATCbits.LATC4 = 1; } while(0)
#define X9C_CS_SetLow()             do { LATCbits.LATC4 = 0; } while(0)
#define X9C_CS_Toggle()             do { LATCbits.LATC4 = ~LATCbits.LATC4; } while(0)
#define X9C_CS_GetValue()           PORTCbits.RC4
#define X9C_CS_SetDigitalInput()    do { TRISCbits.TRISC4 = 1; } while(0)
#define X9C_CS_SetDigitalOutput()   do { TRISCbits.TRISC4 = 0; } while(0)
#define X9C_CS_SetPullup()          do { WPUCbits.WPUC4 = 1; } while(0)
#define X9C_CS_ResetPullup()        do { WPUCbits.WPUC4 = 0; } while(0)
#define X9C_CS_SetPushPull()        do { ODCONCbits.ODCC4 = 0; } while(0)
#define X9C_CS_SetOpenDrain()       do { ODCONCbits.ODCC4 = 1; } while(0)
#define X9C_CS_SetAnalogMode()      do { ANSELCbits.ANSC4 = 1; } while(0)
#define X9C_CS_SetDigitalMode()     do { ANSELCbits.ANSC4 = 0; } while(0)
// get/set IO_RC5 aliases
#define IO_RC5_TRIS                 TRISCbits.TRISC5
#define IO_RC5_LAT                  LATCbits.LATC5
#define IO_RC5_PORT                 PORTCbits.RC5
#define IO_RC5_WPU                  WPUCbits.WPUC5
#define IO_RC5_OD                   ODCONCbits.ODCC5
#define IO_RC5_ANS                  ANSELCbits.ANSC5
#define IO_RC5_SetHigh()            do { LATCbits.LATC5 = 1; } while(0)
#define IO_RC5_SetLow()             do { LATCbits.LATC5 = 0; } while(0)
#define IO_RC5_Toggle()             do { LATCbits.LATC5 = ~LATCbits.LATC5; } while(0)
#define IO_RC5_GetValue()           PORTCbits.RC5
#define IO_RC5_SetDigitalInput()    do { TRISCbits.TRISC5 = 1; } while(0)
#define IO_RC5_SetDigitalOutput()   do { TRISCbits.TRISC5 = 0; } while(0)
#define IO_RC5_SetPullup()          do { WPUCbits.WPUC5 = 1; } while(0)
#define IO_RC5_ResetPullup()        do { WPUCbits.WPUC5 = 0; } while(0)
#define IO_RC5_SetPushPull()        do { ODCONCbits.ODCC5 = 0; } while(0)
#define IO_RC5_SetOpenDrain()       do { ODCONCbits.ODCC5 = 1; } while(0)
#define IO_RC5_SetAnalogMode()      do { ANSELCbits.ANSC5 = 1; } while(0)
#define IO_RC5_SetDigitalMode()     do { ANSELCbits.ANSC5 = 0; } while(0)
// get/set IO_RC6 aliases
#define X9C_INC_TRIS                 TRISCbits.TRISC6
#define X9C_INC_LAT                  LATCbits.LATC6
#define X9C_INC_PORT                 PORTCbits.RC6
#define X9C_INC_WPU                  WPUCbits.WPUC6
#define X9C_INC_OD                   ODCONCbits.ODCC6
#define X9C_INC_ANS                  ANSELCbits.ANSC6
#define X9C_INC_SetHigh()            do { LATCbits.LATC6 = 1; } while(0)
#define X9C_INC_SetLow()             do { LATCbits.LATC6 = 0; } while(0)
#define X9C_INC_Toggle()             do { LATCbits.LATC6 = ~LATCbits.LATC6; } while(0)
#define X9C_INC_GetValue()           PORTCbits.RC6
#define X9C_INC_SetDigitalInput()    do { TRISCbits.TRISC6 = 1; } while(0)
#define X9C_INC_SetDigitalOutput()   do { TRISCbits.TRISC6 = 0; } while(0)
#define X9C_INC_SetPullup()          do { WPUCbits.WPUC6 = 1; } while(0)
#define X9C_INC_ResetPullup()        do { WPUCbits.WPUC6 = 0; } while(0)
#define X9C_INC_SetPushPull()        do { ODCONCbits.ODCC6 = 0; } while(0)
#define X9C_INC_SetOpenDrain()       do { ODCONCbits.ODCC6 = 1; } while(0)
#define X9C_INC_SetAnalogMode()      do { ANSELCbits.ANSC6 = 1; } while(0)
#define X9C_INC_SetDigitalMode()     do { ANSELCbits.ANSC6 = 0; } while(0)
// get/set IO_RC7 aliases
#define X9C_UD_TRIS                 TRISCbits.TRISC7
#define X9C_UD_LAT                  LATCbits.LATC7
#define X9C_UD_PORT                 PORTCbits.RC7
#define X9C_UD_WPU                  WPUCbits.WPUC7
#define X9C_UD_OD                   ODCONCbits.ODCC7
#define X9C_UD_ANS                  ANSELCbits.ANSC7
#define X9C_UD_SetHigh()            do { LATCbits.LATC7 = 1; } while(0)
#define X9C_UD_SetLow()             do { LATCbits.LATC7 = 0; } while(0)
#define X9C_UD_Toggle()             do { LATCbits.LATC7 = ~LATCbits.LATC7; } while(0)
#define X9C_UD_GetValue()           PORTCbits.RC7
#define X9C_UD_SetDigitalInput()    do { TRISCbits.TRISC7 = 1; } while(0)
#define X9C_UD_SetDigitalOutput()   do { TRISCbits.TRISC7 = 0; } while(0)
#define X9C_UD_SetPullup()          do { WPUCbits.WPUC7 = 1; } while(0)
#define X9C_UD_ResetPullup()        do { WPUCbits.WPUC7 = 0; } while(0)
#define X9C_UD_SetPushPull()        do { ODCONCbits.ODCC7 = 0; } while(0)
#define X9C_UD_SetOpenDrain()       do { ODCONCbits.ODCC7 = 1; } while(0)
#define X9C_UD_SetAnalogMode()      do { ANSELCbits.ANSC7 = 1; } while(0)
#define X9C_UD_SetDigitalMode()     do { ANSELCbits.ANSC7 = 0; } while(0)
/**
 * @ingroup  pinsdriver
 * @brief GPIO and peripheral I/O initialization
 * @param none
 * @return none
 */
void PIN_MANAGER_Initialize (void);

/**
 * @ingroup  pinsdriver
 * @brief Interrupt on Change Handling routine
 * @param none
 * @return none
 */
void PIN_MANAGER_IOC(void);

/**
 * @ingroup  pinsdriver
 * @brief Interrupt on Change Handler for the IO_RA4 pin functionality
 * @param none
 * @return none
 */
void IO_RA4_ISR(void);

/**
 * @ingroup  pinsdriver
 * @brief Interrupt Handler Setter for IO_RA4 pin interrupt-on-change functionality.
 *        Allows selecting an interrupt handler for IO_RA4 at application runtime.
 * @pre Pins intializer called
 * @param InterruptHandler function pointer.
 * @return none
 */
void IO_RA4_SetInterruptHandler(void (* InterruptHandler)(void));

/**
 * @ingroup  pinsdriver
 * @brief Dynamic Interrupt Handler for IO_RA4 pin.
 *        This is a dynamic interrupt handler to be used together with the IO_RA4_SetInterruptHandler() method.
 *        This handler is called every time the IO_RA4 ISR is executed and allows any function to be registered at runtime.
 * @pre Pins intializer called
 * @param none
 * @return none
 */
extern void (*IO_RA4_InterruptHandler)(void);

/**
 * @ingroup  pinsdriver
 * @brief Default Interrupt Handler for IO_RA4 pin. 
 *        This is a predefined interrupt handler to be used together with the IO_RA4_SetInterruptHandler() method.
 *        This handler is called every time the IO_RA4 ISR is executed. 
 * @pre Pins intializer called
 * @param none
 * @return none
 */
void IO_RA4_DefaultInterruptHandler(void);


#endif // PINS_H
/**
 End of File
*/